namespace HW2.T2
{
    public class Cello : MusicalInstrument
    {
        public Cello() : base(
            "Віолончель (Cello)",
            "Струнно-смичковий інструмент басового регістру. 4 струни, діапазон від C2 до A6. Грають сидячи, тримаючи між колінами.",
            "З'явилася в Італії у XVI столітті як басова версія скрипки. Спочатку називалась 'violoncello' (маленька віола)."
        )
        { }

        public override void Show()
        {
            Console.WriteLine($"🎻 {Name}");
        }
    }
}

